## Pandas conexion a MySQL
pip install mysql-connector-python

In [7]:
import pandas as pd
import mysql.connector as connector

In [8]:
connection = connector.connect(
    host="localhost",
    port="3306",
    user="root",
    password="admin",
    database="world"
)

In [12]:
df_city = pd.read_sql("SELECT * FROM city;", connection)
df_country = pd.read_sql("SELECT * FROM country;", connection)
df_lang = pd.read_sql("SELECT * FROM countrylanguage;", connection)
df_city.head()

C:\Users\bardo\AppData\Local\Temp\ipykernel_4816\519434791.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_city = pd.read_sql("SELECT * FROM city;", connection)
C:\Users\bardo\AppData\Local\Temp\ipykernel_4816\519434791.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_country = pd.read_sql("SELECT * FROM country;", connection)
C:\Users\bardo\AppData\Local\Temp\ipykernel_4816\519434791.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_lang = pd.read_sql("SELECT * FROM countrylanguage;", connection)

   ID            Name CountryCode       District  Population
0   1           Kabul         AFG          Kabol     1780000
1   2        Qandahar         AFG       Qandahar      237500
2   3           Herat         AFG          Herat      186800
3   4  Mazar-e-Sharif         AFG          Balkh      127800
4   5       Amsterdam         NLD  Noord-Holland      731200

In [10]:
df_country.head()

,Code,Name,Continent,Region,SurfaceArea,IndepYear,Population,LifeExpectancy,GNP,GNPOld,LocalName,GovernmentForm,HeadOfState,Capital,Code2
0,ABW,Aruba,North America,Caribbean,193.0,NaN,103000,78.4,828.0,793.0,Aruba,Nonmetropolitan Territory of The Netherlands,Beatrix,129.0,AW
1,AFG,Afghanistan,Asia,Southern and Central Asia,652090.0,1919.0,22720000,45.9,5976.0,NaN,Afganistan/Afqanestan,Islamic Emirate,Mohammad Omar,1.0,AF
2,AGO,Angola,Africa,Central Africa,1246700.0,1975.0,12878000,38.3,6648.0,7984.0,Angola,Republic,José Eduardo dos Santos,56.0,AO
3,AIA,Anguilla,North America,Caribbean,96.0,NaN,8000,76.1,63.2,NaN,Anguilla,Dependent Territory of the UK,Elisabeth II,62.0,AI
4,ALB,Albania,Europe,Southern Europe,28748.0,1912.0,3401200,71.6,3205.0,2500.0,Shqipëria,Republic,Rexhep Mejdani,34.0,AL

In [6]:
connection.close()

In [13]:
from sqlalchemy import create_engine
import pandas as pd

In [46]:
url = 'mysql+mysqlconnector://root:admin@localhost:3306/word'
engine =create_engine(url)

In [ ]:
df_city = pd.read_sql("SELECT * FROM city;", engine)
df_country = pd.read_sql("SELECT * FROM country;", engine)
df_lang = pd.read_sql("SELECT * FROM countrylanguage;", engine)

In [14]:
df_city.head()

   ID            Name CountryCode       District  Population
0   1           Kabul         AFG          Kabol     1780000
1   2        Qandahar         AFG       Qandahar      237500
2   3           Herat         AFG          Herat      186800
3   4  Mazar-e-Sharif         AFG          Balkh      127800
4   5       Amsterdam         NLD  Noord-Holland      731200

## Insertar filas en DataFrame

In [49]:
df_city.tail()

        ID       Name CountryCode    District  Population
4076  4077   Jabaliya         PSE  North Gaza      113901
4077  4078     Nablus         PSE      Nablus      100231
4078  4079      Rafah         PSE       Rafah       92020
4080  4080  Tomelloso         ESP   Tomelloso           5
4079  None  Tomelloso         ESP   Tomelloso           5

In [50]:
new_row = pd.DataFrame({
    'Name': 'Tomelloso',
    'CountryCode': 'ESP',
    'Disctrict': 'Tomelloso',
    'Population': 4
}, index=df_city.index)

In [51]:
count = len(df_city.index)
count

4081

In [52]:
df_city.loc[count] = [None,'Tomelloso', 'ESP', 'Tomelloso', 5]

In [53]:
df_city.head()

  ID            Name CountryCode       District  Population
0  1           Kabul         AFG          Kabol     1780000
1  2        Qandahar         AFG       Qandahar      237500
2  3           Herat         AFG          Herat      186800
3  4  Mazar-e-Sharif         AFG          Balkh      127800
4  5       Amsterdam         NLD  Noord-Holland      731200

In [54]:
count = len(df_city.index)
count

4082

In [55]:
df_city.tail()

        ID       Name CountryCode   District  Population
4077  4078     Nablus         PSE     Nablus      100231
4078  4079      Rafah         PSE      Rafah       92020
4080  4080  Tomelloso         ESP  Tomelloso           5
4079  None  Tomelloso         ESP  Tomelloso           5
4081  None  Tomelloso         ESP  Tomelloso           5

## Insertar DataFrame en Base de datos

In [ ]:
df_city.to_sql(name='city2', con=engine, if_exists='append', index=False)

## Crear tabla desde Python

In [57]:
import mysql.connector as connector

In [58]:
connection = connector.connect(
    host="localhost",
    port="3306",
    user="root",
    password="admin",
    database="world"
)

cursor = connection.cursor()

sql = """
    CREATE TABLE IF NOT EXISTS city2 (
       `ID` BIGINT AUTO_INCREMENT PRIMARY KEY,
       Name char(35) NOT NULL DEFAULT '',
       CountryCode char(3) NOT NULL DEFAULT '',
       District char(20) NOT NULL DEFAULT '',
       Population int NOT NULL DEFAULT '0',
       FOREIGN KEY (CountryCode) REFERENCES country (Code) 
    );
""" 
cursor.execute(sql)
connection.commit()
cursor.close()
connection.close()

In [ ]:
df_city = pd.read_sql("SELECT * FROM city;", engine, index_col='ID')
df_city.head()